In [2]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [14]:
import webbrowser
website='https://en.wikipedia.org/wiki/The_Rugby_Championship'
webbrowser.open(website)

True

In [22]:
#Headers cleaned prior to copying to clipboard
rugby_frame = pd.read_clipboard()

In [24]:
rugby_frame

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2
2,Australia,63,26,3,34,"1,411","1,735",−324,14,131,1
3,Argentina,63,12,1,50,"1,196","2,063",−867,14,60,0

In [26]:
rugby_frame.columns

Index(['Nation', 'Played', 'Won', 'Draw', 'Lost', 'Points For',
       'Points Against', 'Point Difference', 'Bonus Points', 'Table Points',
       'Titles Won'],
      dtype='object')

In [30]:
rugby_frame.Won

0    51
1    33
2    26
3    12
Name: Won, dtype: int64

In [32]:
rugby_frame['Titles Won']

0    9
1    2
2    1
3    0
Name: Titles Won, dtype: int64

In [34]:
DataFrame(rugby_frame,columns=['Nation','Played','Titles Won'])

         Nation  Played  Titles Won
0   New Zealand      63           9
1  South Africa      63           2
2     Australia      63           1
3     Argentina      63           0

In [36]:
DataFrame(rugby_frame,columns=['Nation','Played','Titles Won','First Season'])

         Nation  Played  Titles Won  First Season
0   New Zealand      63           9           NaN
1  South Africa      63           2           NaN
2     Australia      63           1           NaN
3     Argentina      63           0           NaN

In [40]:
rugby_frame.head()

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2
2,Australia,63,26,3,34,"1,411","1,735",−324,14,131,1
3,Argentina,63,12,1,50,"1,196","2,063",−867,14,60,0

In [42]:
rugby_frame.head(2)

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2

In [46]:
rugby_frame.loc[3]
# rugby_frame.ix[3] - ix was removed from pandas

Nation              Argentina
Played                     63
Won                        12
Draw                        1
Lost                       50
Points For              1,196
Points Against          2,063
Point Difference         −867
Bonus Points               14
Table Points               60
Titles Won                  0
Name: 3, dtype: object

In [48]:
rugby_frame['Stadium']='Westpac Stadium'

In [50]:
rugby_frame

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won,Stadium
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9,Westpac Stadium
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2,Westpac Stadium
2,Australia,63,26,3,34,"1,411","1,735",−324,14,131,1,Westpac Stadium
3,Argentina,63,12,1,50,"1,196","2,063",−867,14,60,0,Westpac Stadium

In [100]:
rugby_frame['Stadium'] = np.arange(4)

In [102]:
rugby_frame

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won,Stadium
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9,0
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2,1
2,Australia,63,26,3,34,"1,411","1,735",−324,14,131,1,2
3,Argentina,63,12,1,50,"1,196","2,063",−867,14,60,0,3

In [88]:
stadiums = Series(["Levi's Stadium",'Westpac'],index=[3,0])

In [90]:
stadiums

3    Levi's Stadium
0           Westpac
dtype: object

rugby_frame['Stadium'] = stadiums

In [104]:
rugby_frame

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won,Stadium
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9,0
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2,1
2,Australia,63,26,3,34,"1,411","1,735",−324,14,131,1,2
3,Argentina,63,12,1,50,"1,196","2,063",−867,14,60,0,3

In [106]:
del rugby_frame['Stadium']

In [108]:
rugby_frame

,Nation,Played,Won,Draw,Lost,Points For,Points Against,Point Difference,Bonus Points,Table Points,Titles Won
0,New Zealand,63,51,2,10,"2,154","1,197",957,40,249,9
1,South Africa,63,33,4,26,"1,637","1,383",254,30,166,2
2,Australia,63,26,3,34,"1,411","1,735",−324,14,131,1
3,Argentina,63,12,1,50,"1,196","2,063",−867,14,60,0

In [110]:
data = {'City':['SF','LA','NYC'],'Population':[837000,3880000,8400000]}

In [112]:
city_frame = DataFrame(data)

In [114]:
city_frame

  City  Population
0   SF      837000
1   LA     3880000
2  NYC     8400000

In [120]:
website='https://pandas.pydata.org/pandas-docs/dev/reference/api/pandas.DataFrame.html'
webbrowser.open(website)

True